In [1]:
import pandas as pd
data = pd.read_csv('age_of_marriage_data.csv')
data.head()

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0

In [2]:
data.isnull().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage     19
dtype: int64

In [3]:
data.shape

(2567, 10)

In [4]:
data.dropna().shape

(1932, 10)

In [5]:
(data.shape[0] - data.dropna().shape[0])/data.shape[0]

0.24737047136735488

In [6]:
data.dropna(inplace=True)

In [7]:
data.shape

(1932, 10)

In [8]:
data.head(2)

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1932 entries, 1 to 2566
Data columns (total 10 columns):
id                 1932 non-null int64
gender             1932 non-null object
height             1932 non-null object
religion           1932 non-null object
caste              1932 non-null object
mother_tongue      1932 non-null object
profession         1932 non-null object
location           1932 non-null object
country            1932 non-null object
age_of_marriage    1932 non-null float64
dtypes: float64(1), int64(1), object(8)
memory usage: 166.0+ KB

In [13]:
x = data.loc[:,['gender','height','religion','caste','mother_tongue','country']]
y = data.age_of_marriage

In [14]:
x.head()

   gender height   religion        caste mother_tongue country
1    male   5'7"       Jain   Shwetamber      Gujarati     USA
2    male   5'7"      Hindu      Brahmin         Hindi   India
3  female   5'0"      Hindu       Thakur         Hindi   India
4    male   5'5"  Christian   Born Again     Malayalam   India
5    male   5'5"      Hindu      Valmiki         Hindi   India

In [18]:
from sklearn.preprocessing import LabelEncoder
enc = LabelEncoder()
x.loc[:,['gender','religion','caste','mother_tongue','country']] = x.loc[:,['gender','religion','caste','mother_tongue','country']].apply(enc.fit_transform)

In [19]:
x.head()

  gender height religion caste mother_tongue country
1      1   5'7"        2    34             6      19
2      1   5'7"        1    14             8       5
3      0   5'0"        1    36             8       5
4      1   5'5"        0    13            13       5
5      1   5'5"        1    38             8       5

In [20]:

def h_cms(h):
    return int(h.split('\'')[0])*30.48+\
    int(h.split('\'')[1].replace('"',''))*2.54

In [23]:

x['height_cms'] = x.height.apply(h_cms)

In [24]:

x.drop('height',inplace=True,axis=1)

In [26]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=0)

In [28]:
from sklearn.ensemble import RandomForestRegressor
model = RandomForestRegressor(n_estimators=80,max_depth=11)
model.fit(X_train,y_train)
y_predict = model.predict(X_test)

In [30]:

from sklearn.metrics import mean_absolute_error, r2_score
print("MAE : ", mean_absolute_error(y_test,y_predict))
r2_score(y_test,y_predict)

MAE :  1.0270020790078762

0.6994241022556772

In [31]:
from sklearn.externals import joblib
joblib.dump(model,'marriage_age_predict_model.ml')

['marriage_age_predict_model.ml']

In [32]:
# Load model

In [33]:
model = joblib.load('marriage_age_predict_model.ml')

In [35]:
model.predict([[1,2,5,6,5,175]])

array([29.02448384])